CASES/MRB_2D/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0.0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    
    INLET_JET
    {
        type            fixedValue;
        value           uniform (105 0 0);
    }
    
    INLET_SLOT_1
    {
        type            fixedValue;
        value           uniform (15 0 0);
    }
    INLET_SLOT_2
    {
        type            fixedValue;
        value           uniform (20 0 0);
    }
    
    INLET_COFLOW

    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    
    
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }
    
    WALL_BB_1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    WALL_BB_2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    WALL_JET
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    SIDE
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    FRONT
    {
        type            cyclic;
    }

    BACK
    {
        type            cyclic;
    }
    
    AXIS
    {
        type            symmetry;
    }
}


// ************************************************************************* //
