CASES/MRB_2D/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0.5";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
    "INLET_.*"
    {
        type            calculated;
        value           uniform 0;
    }
    
    
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
    
    "WALL_.*"
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1e-5;
    }

    SIDE
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1e-5;
    }
    FRONT
    {
        type            cyclic;
    }

    BACK
    {
        type            cyclic;
    }
    
    AXIS
    {
        type            symmetry;
    }
}


// ************************************************************************* //
